nc: 3 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, My_Star_Block, [128]]
  - [-1, 2, C3k2, [256, True]]
  - [-1, 1, LK_Depth_Separable_Wise, [256]]
  - [-1, 1, MyWTConv2d, [512]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 2, A2C2f, [256, False, -1]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, A2C2f, [128, False, -1]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 2, A2C2f, [256, False, -1]]

  - [[10, 13], 1, Detect, [nc]]